IdeaRS.OpenModel.Loading.PointLoadOnLine
Load in specific point on line
This sample shows how to create a point load on the line.
//Creating the model
OpenModel openModel = new OpenModel();
//Create nodes
Point3D pointA = new Point3D();
pointA.X = 0;
pointA.Y = 0;
pointA.Z = 0;
openModel.AddObject(pointA);
Point3D pointB = new Point3D();
pointB.X = 0;
pointB.Y = 0;
pointB.Z = 1.2;
openModel.AddObject(pointB);
Point3D pointC = new Point3D();
pointC.X = 0;
pointC.Y = 0;
pointC.Z = 2.4;
openModel.AddObject(pointC);
//Line between nodes
LineSegment3D line1 = new LineSegment3D();
line1.StartPoint = new ReferenceElement(pointA);
line1.EndPoint = new ReferenceElement(pointB);
//LCS of line
line1.LocalCoordinateSystem = new CoordSystemByZup();
openModel.AddObject(line1);
//Line between nodes
LineSegment3D line2 = new LineSegment3D();
line2.StartPoint = new ReferenceElement(pointB);
line2.EndPoint = new ReferenceElement(pointC);
//LCS of line
line2.LocalCoordinateSystem = new CoordSystemByZup();
openModel.AddObject(line2);
//Load case
LoadCase loadCase = new LoadCase();
//...
openModel.AddObject(loadCase);
//Point loading impulse on the bottom of the "line1" - in the LCS of line
PointLoadOnLine pointLoadA = new PointLoadOnLine();
pointLoadA.Geometry = new ReferenceElement(line1);
pointLoadA.RelativePosition = 0.0;
pointLoadA.Fx = 10e3;
pointLoadA.Ez = 0.024;
openModel.AddObject(pointLoadA);
loadCase.PointLoadsOnLine.Add(new ReferenceElement(pointLoadA));

IdeaRS.OpenModel.Loading.PointLoadOnLine.#ctor
Constructor

IdeaRS.OpenModel.Loading.PointLoadOnLine.Direction
Local / global

IdeaRS.OpenModel.Loading.PointLoadOnLine.Fx
Force in X direction

IdeaRS.OpenModel.Loading.PointLoadOnLine.Fy
Force in Y direction

IdeaRS.OpenModel.Loading.PointLoadOnLine.Fz
Force in Z direction

IdeaRS.OpenModel.Loading.PointLoadOnLine.Mx
Moment about the x-axis

IdeaRS.OpenModel.Loading.PointLoadOnLine.My
Moment about the y-axis

IdeaRS.OpenModel.Loading.PointLoadOnLine.Mz
Moment about the z-axis

IdeaRS.OpenModel.Loading.PointLoadOnLine.Ey
Eccentricity in Y direction

IdeaRS.OpenModel.Loading.PointLoadOnLine.Ez
Eccentricity in Z direction

IdeaRS.OpenModel.Loading.PointLoadOnLine.Geometry
Segment3D or PolyLine3D

IdeaRS.OpenModel.Loading.PointLoadOnLine.RelativePosition
Relative position on geometry line